In [1]:
# %pip install chardet
# %pip install charset-normalizer
# %pip install pymysql
import pymysql
import pandas as pd
import numpy as np
import chardet
import charset_normalizer as cn
import re

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', None)  # me muestre todas las columnas
#pd.set_option('display.max_rows', None)  # me muestre todas las filas

In [2]:
def capitalize_first_letter(df, column_name):
    df[column_name] = df[column_name].str.title()
    return df

# Actor, (esta tabla creía que la podía omitir porque los datos que contiene son irrelevantes, o estan repetidos o no tienen ninguna correlación con el resto, pero la necesito ya que es la unica que puede asignarme una primary key parala tabla actores, fuck it)

In [3]:
df_actor_origin = pd.read_csv(r'..\data\actor.csv', encoding='latin1')
actor = df_actor_origin.copy()
actor.head(20)

    actor_id first_name     last_name          last_update
0          1   PENELOPE       GUINESS  2006-02-15 04:34:33
1          2       NICK      WAHLBERG  2006-02-15 04:34:33
2          3         ED         CHASE  2006-02-15 04:34:33
3          4   JENNIFER         DAVIS  2006-02-15 04:34:33
4          5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
5          6      BETTE     NICHOLSON  2006-02-15 04:34:33
6          7      GRACE        MOSTEL  2006-02-15 04:34:33
7          8    MATTHEW     JOHANSSON  2006-02-15 04:34:33
8          9        JOE         SWANK  2006-02-15 04:34:33
9         10  CHRISTIAN         GABLE  2006-02-15 04:34:33
10        11       ZERO          CAGE  2006-02-15 04:34:33
11        12       KARL         BERRY  2006-02-15 04:34:33
12        13        UMA          WOOD  2006-02-15 04:34:33
13        14     VIVIEN        BERGEN  2006-02-15 04:34:33
14        15       CUBA       OLIVIER  2006-02-15 04:34:33
15        16       FRED       COSTNER  2006-02-15 04:34:33
16        17      HELEN        VOIGHT  2006-02-15 04:34:33
17        18        DAN          TORN  2006-02-15 04:34:33
18        19        BOB       FAWCETT  2006-02-15 04:34:33
19        20    LUCILLE         TRACY  2006-02-15 04:34:33

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [5]:
actor.shape

(200, 4)

In [6]:
actor = actor.drop('last_update', axis=1)
actor.head(20)

    actor_id first_name     last_name
0          1   PENELOPE       GUINESS
1          2       NICK      WAHLBERG
2          3         ED         CHASE
3          4   JENNIFER         DAVIS
4          5     JOHNNY  LOLLOBRIGIDA
5          6      BETTE     NICHOLSON
6          7      GRACE        MOSTEL
7          8    MATTHEW     JOHANSSON
8          9        JOE         SWANK
9         10  CHRISTIAN         GABLE
10        11       ZERO          CAGE
11        12       KARL         BERRY
12        13        UMA          WOOD
13        14     VIVIEN        BERGEN
14        15       CUBA       OLIVIER
15        16       FRED       COSTNER
16        17      HELEN        VOIGHT
17        18        DAN          TORN
18        19        BOB       FAWCETT
19        20    LUCILLE         TRACY

In [7]:
actor.duplicated().any()

False

In [8]:
actor['name'] = actor['first_name'].astype(str).str.cat(actor['last_name'], sep=' ')
actor

     actor_id first_name     last_name                 name
0           1   PENELOPE       GUINESS     PENELOPE GUINESS
1           2       NICK      WAHLBERG        NICK WAHLBERG
2           3         ED         CHASE             ED CHASE
3           4   JENNIFER         DAVIS       JENNIFER DAVIS
4           5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA
..        ...        ...           ...                  ...
195       196       BELA        WALKEN          BELA WALKEN
196       197      REESE          WEST           REESE WEST
197       198       MARY        KEITEL          MARY KEITEL
198       199      JULIA       FAWCETT        JULIA FAWCETT
199       200      THORA        TEMPLE         THORA TEMPLE

[200 rows x 4 columns]

# Category (done)

In [9]:
df_category_origin = pd.read_csv(r'..\data\category.csv', encoding='latin1')
category = df_category_origin.copy()
category.head(20)

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [10]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [11]:
category.shape

(16, 3)

In [12]:
category = category.drop('last_update', axis=1)
category

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [13]:
category.columns = ['category_id', 'category']
category

    category_id     category
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [14]:
category.to_csv(r'..\data\df_category.csv', index=False)

# Inventory (done)

In [15]:
df_inventory_origin = pd.read_csv(r'..\data\inventory.csv', encoding='latin1')
inventory = df_inventory_origin.copy()
inventory.head(20)

    inventory_id  film_id  store_id          last_update
0              1        1         1  2006-02-15 05:09:17
1              2        1         1  2006-02-15 05:09:17
2              3        1         1  2006-02-15 05:09:17
3              4        1         1  2006-02-15 05:09:17
4              5        1         2  2006-02-15 05:09:17
5              6        1         2  2006-02-15 05:09:17
6              7        1         2  2006-02-15 05:09:17
7              8        1         2  2006-02-15 05:09:17
8              9        2         2  2006-02-15 05:09:17
9             10        2         2  2006-02-15 05:09:17
10            11        2         2  2006-02-15 05:09:17
11            12        3         2  2006-02-15 05:09:17
12            13        3         2  2006-02-15 05:09:17
13            14        3         2  2006-02-15 05:09:17
14            15        3         2  2006-02-15 05:09:17
15            16        4         1  2006-02-15 05:09:17
16            17        4         1  2006-02-15 05:09:17
17            18        4         1  2006-02-15 05:09:17
18            19        4         1  2006-02-15 05:09:17
19            20        4         2  2006-02-15 05:09:17

In [16]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [17]:
inventory.shape

(1000, 4)

In [18]:
inventory.duplicated().any()

False

In [19]:
inventory['film_id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223],
      dtype=int64)

In [20]:
len(inventory['film_id'].unique())

207

In [21]:
inventory['store_id'].unique()

array([1, 2], dtype=int64)

In [22]:
inventory['stock'] = 1 # cuando esta columna este rellenada con un '1' significará que la película está en el stock, 
# si por el contrario está con un '0', la película estará alquilada.
inventory

     inventory_id  film_id  store_id          last_update  stock
0               1        1         1  2006-02-15 05:09:17      1
1               2        1         1  2006-02-15 05:09:17      1
2               3        1         1  2006-02-15 05:09:17      1
3               4        1         1  2006-02-15 05:09:17      1
4               5        1         2  2006-02-15 05:09:17      1
..            ...      ...       ...                  ...    ...
995           996      222         2  2006-02-15 05:09:17      1
996           997      222         2  2006-02-15 05:09:17      1
997           998      222         2  2006-02-15 05:09:17      1
998           999      223         2  2006-02-15 05:09:17      1
999          1000      223         2  2006-02-15 05:09:17      1

[1000 rows x 5 columns]

In [23]:
inventory = inventory.drop(['last_update', 'store_id'], axis=1)
inventory

     inventory_id  film_id  stock
0               1        1      1
1               2        1      1
2               3        1      1
3               4        1      1
4               5        1      1
..            ...      ...    ...
995           996      222      1
996           997      222      1
997           998      222      1
998           999      223      1
999          1000      223      1

[1000 rows x 3 columns]

In [24]:
# cambiar las columnas de posición
# Especificar el nuevo orden de columnas
new_order = ['inventory_id', 'stock', 'film_id']

# Reindexar el DataFrame con el nuevo orden de columnas
inventory = inventory.reindex(columns=new_order)
inventory

     inventory_id  stock  film_id
0               1      1        1
1               2      1        1
2               3      1        1
3               4      1        1
4               5      1        1
..            ...    ...      ...
995           996      1      222
996           997      1      222
997           998      1      222
998           999      1      223
999          1000      1      223

[1000 rows x 3 columns]

In [25]:
inventory.to_csv(r'..\data\df_inventory.csv', index=False)

# Language (done)

In [26]:
df_language_origin = pd.read_csv(r'..\data\language.csv', encoding='latin1')
language = df_language_origin.copy()
language.head(20)

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [27]:
language.shape

(6, 3)

In [28]:
language = language.drop('last_update', axis=1)
language

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

# Old_HDD = actores

In [29]:
df_old_HDD_origin = pd.read_csv(r'..\data\old_HDD.csv', encoding='latin1')
df_actores = df_old_HDD_origin.copy()
df_actores.head(20)

   first_name last_name                  title  release_year  category_id
0    PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1    PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2    PENELOPE   GUINESS            ANGELS LIFE          2006           13
3    PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4    PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
5    PENELOPE   GUINESS     COLOR PHILADELPHIA          2006            4
6    PENELOPE   GUINESS        ELEPHANT TROJAN          2006           11
7    PENELOPE   GUINESS    GLEAMING JAWBREAKER          2006           15
8    PENELOPE   GUINESS         HUMAN GRAFFITI          2006           10
9    PENELOPE   GUINESS         KING EVOLUTION          2006            8
10   PENELOPE   GUINESS             LADY STAGE          2006           11
11   PENELOPE   GUINESS        LANGUAGE COWBOY          2006            3
12   PENELOPE   GUINESS       MULHOLLAND BEAST          2006            9
13   PENELOPE   GUINESS       OKLAHOMA JUMANJI          2006           13
14   PENELOPE   GUINESS            RULES HUMAN          2006           11
15   PENELOPE   GUINESS            SPLASH GUMP          2006            8
16   PENELOPE   GUINESS      VERTIGO NORTHWEST          2006            5
17   PENELOPE   GUINESS    WESTWARD SEABISCUIT          2006            4
18   PENELOPE   GUINESS     WIZARD COLDBLOODED          2006           12
19       NICK  WAHLBERG       ADAPTATION HOLES          2006            6

In [30]:
df_actores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [31]:
df_actores.shape

(1000, 5)

In [32]:
len(df_actores['title'].unique())

614

# Film

In [33]:
df_film_origin = pd.read_csv(r'..\data\film.csv', encoding='latin1')
df_film = df_film_origin.copy()
df_film.head(20)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
5,6,AGENT TRUMAN,A Intrepid Panorama of a Robot And a Boy who m...,2006,1,NaN,3,2.99,169,17.99,PG,Deleted Scenes,2006-02-15 05:03:42
6,7,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,1,NaN,6,4.99,62,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42
7,8,AIRPORT POLLOCK,A Epic Tale of a Moose And a Girl who must Con...,2006,1,NaN,6,4.99,54,15.99,R,Trailers,2006-02-15 05:03:42
8,9,ALABAMA DEVIL,A Thoughtful Panorama of a Database Administra...,2006,1,NaN,3,2.99,114,21.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42
9,10,ALADDIN CALENDAR,A Action-Packed Tale of a Man And a Lumberjack...,2006,1,NaN,6,4.99,63,24.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
10,11,ALAMO VIDEOTAPE,A Boring Epistle of a Butler And a Cat who mus...,2006,1,NaN,6,0.99,126,16.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
11,12,ALASKA PHANTOM,A Fanciful Saga of a Hunter And a Pastry Chef ...,2006,1,NaN,6,0.99,136,22.99,PG,"Commentaries,Deleted Scenes",2006-02-15 05:03:42
12,13,ALI FOREVER,A Action-Packed Drama of a Dentist And a Croco...,2006,1,NaN,4,4.99,150,21.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
13,14,ALICE FANTASIA,A Emotional Drama of a A Shark And a Database ...,2006,1,NaN,6,0.99,94,23.99,NC-17,"Trailers,Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
14,15,ALIEN CENTER,A Brilliant Drama of a Cat And a Mad Scientist...,2006,1,NaN,5,2.99,46,10.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
15,16,ALLEY EVOLUTION,A Fast-Paced Drama of a Robot And a Composer w...,2006,1,NaN,6,2.99,180,23.99,NC-17,"Trailers,Commentaries",2006-02-15 05:03:42
16,17,ALONE TRIP,A Fast-Paced Character Study of a Composer And...,2006,1,NaN,3,0.99,82,14.99,R,"Trailers,Behind the Scenes",2006-02-15 05:03:42
17,18,ALTER VICTORY,A Thoughtful Drama of a Composer And a Feminis...,2006,1,NaN,6,0.99,57,27.99,PG-13,"Trailers,Behind the Scenes",2006-02-15 05:03:42
18,19,AMADEUS HOLY,A Emotional Display of a Pioneer And a Technic...,2006,1,NaN,6,0.99,113,20.99,PG,"Commentaries,Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
19,20,AMELIE HELLFIGHTERS,A Boring Drama of a Woman And a Squirrel who m...,2006,1,NaN,4,4.99,79,23.99,R,"Commentaries,Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [34]:
df_film.info() # la columna de 'original_language_id' son todos valores nulos, por lo tanto la voy a eliminar y, 
# la columna de 'rating' tambien ya que debería de dar información de la valoración de la pelicula y hay valores 
# que no tienen nungún sentido.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [35]:
df_film.shape

(1000, 13)

In [36]:
df_film.duplicated().any()

False

In [37]:
elimate_columns = ['original_language_id', 'rating', 'last_update']

df_film = df_film.drop(elimate_columns, axis=1)

df_film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,Deleted Scenes
...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,"Trailers,Behind the Scenes"
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,"Trailers,Behind the Scenes"
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,Deleted Scenes
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,"Trailers,Deleted Scenes"
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,"Trailers,Commentaries,Behind the Scenes"

In [38]:
len(df_film['title'].unique())

1000

In [39]:
df_film['film_id'].unique()

array([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   11,
         12,   13,   14,   15,   16,   17,   18,   19,   20,   21,   22,
         23,   24,   25,   26,   27,   28,   29,   30,   31,   32,   33,
         34,   35,   36,   37,   38,   39,   40,   41,   42,   43,   44,
         45,   46,   47,   48,   49,   50,   51,   52,   53,   54,   55,
         56,   57,   58,   59,   60,   61,   62,   63,   64,   65,   66,
         67,   68,   69,   70,   71,   72,   73,   74,   75,   76,   77,
         78,   79,   80,   81,   82,   83,   84,   85,   86,   87,   88,
         89,   90,   91,   92,   93,   94,   95,   96,   97,   98,   99,
        100,  101,  102,  103,  104,  105,  106,  107,  108,  109,  110,
        111,  112,  113,  114,  115,  116,  117,  118,  119,  120,  121,
        122,  123,  124,  125,  126,  127,  128,  129,  130,  131,  132,
        133,  134,  135,  136,  137,  138,  139,  140,  141,  142,  143,
        144,  145,  146,  147,  148,  149,  150,  151,  152,  153,  154,
        155,  156,  157,  158,  159,  160,  161,  162,  163,  164,  165,
        166,  167,  168,  169,  170,  171,  172,  173,  174,  175,  176,
        177,  178,  179,  180,  181,  182,  183,  184,  185,  186,  187,
        188,  189,  190,  191,  192,  193,  194,  195,  196,  197,  198,
        199,  200,  201,  202,  203,  204,  205,  206,  207,  208,  209,
        210,  211,  212,  213,  214,  215,  216,  217,  218,  219,  220,
        221,  222,  223,  224,  225,  226,  227,  228,  229,  230,  231,
        232,  233,  234,  235,  236,  237,  238,  239,  240,  241,  242,
        243,  244,  245,  246,  247,  248,  249,  250,  251,  252,  253,
        254,  255,  256,  257,  258,  259,  260,  261,  262,  263,  264,
        265,  266,  267,  268,  269,  270,  271,  272,  273,  274,  275,
        276,  277,  278,  279,  280,  281,  282,  283,  284,  285,  286,
        287,  288,  289,  290,  291,  292,  293,  294,  295,  296,  297,
        298,  299,  300,  301,  302,  303,  304,  305,  306,  307,  308,
        309,  310,  311,  312,  313,  314,  315,  316,  317,  318,  319,
        320,  321,  322,  323,  324,  325,  326,  327,  328,  329,  330,
        331,  332,  333,  334,  335,  336,  337,  338,  339,  340,  341,
        342,  343,  344,  345,  346,  347,  348,  349,  350,  351,  352,
        353,  354,  355,  356,  357,  358,  359,  360,  361,  362,  363,
        364,  365,  366,  367,  368,  369,  370,  371,  372,  373,  374,
        375,  376,  377,  378,  379,  380,  381,  382,  383,  384,  385,
        386,  387,  388,  389,  390,  391,  392,  393,  394,  395,  396,
        397,  398,  399,  400,  401,  402,  403,  404,  405,  406,  407,
        408,  409,  410,  411,  412,  413,  414,  415,  416,  417,  418,
        419,  420,  421,  422,  423,  424,  425,  426,  427,  428,  429,
        430,  431,  432,  433,  434,  435,  436,  437,  438,  439,  440,
        441,  442,  443,  444,  445,  446,  447,  448,  449,  450,  451,
        452,  453,  454,  455,  456,  457,  458,  459,  460,  461,  462,
        463,  464,  465,  466,  467,  468,  469,  470,  471,  472,  473,
        474,  475,  476,  477,  478,  479,  480,  481,  482,  483,  484,
        485,  486,  487,  488,  489,  490,  491,  492,  493,  494,  495,
        496,  497,  498,  499,  500,  501,  502,  503,  504,  505,  506,
        507,  508,  509,  510,  511,  512,  513,  514,  515,  516,  517,
        518,  519,  520,  521,  522,  523,  524,  525,  526,  527,  528,
        529,  530,  531,  532,  533,  534,  535,  536,  537,  538,  539,
        540,  541,  542,  543,  544,  545,  546,  547,  548,  549,  550,
        551,  552,  553,  554,  555,  556,  557,  558,  559,  560,  561,
        562,  563,  564,  565,  566,  567,  568,  569,  570,  571,  572,
        573,  574,  575,  576,  577,  578,  579,  580,  581,  582,  583,
        584,  585,  586,  587,  588,  589,  590,  591,  592,  593,  594,
        595,  596,  597,  598,  599,  600,  601,  602,  603,  604,  605,
        606,  607,  608,  609,  610,  611,  612,  613,  614,  615,  616,
        617,  618,  619,  620,  621,  622,  623,  624,  625,  626,  627,
        628,  629,  630,  631,  632,  633,  634,  635,  636,  637,  638,
        639,  640,  641,  642,  643,  644,  645,  646,  647,  648,  649,
        650,  651,  652,  653,  654,  655,  656,  657,  658,  659,  660,
        661,  662,  663,  664,  665,  666,  667,  668,  669,  670,  671,
        672,  673,  674,  675,  676,  677,  678,  679,  680,  681,  682,
        683,  684,  685,  686,  687,  688,  689,  690,  691,  692,  693,
        694,  695,  696,  697,  698,  699,  700,  701,  702,  703,  704,
        705,  706,  707,  708,  709,  710,  711,  712,  713,  714,  715,
        716,  717,  718,  719,  720,  721,  722,  723,  724,  725,  726,
        727,  728,  729,  730,  731,  732,  733,  734,  735,  736,  737,
        738,  739,  740,  741,  742,  743,  744,  745,  746,  747,  748,
        749,  750,  751,  752,  753,  754,  755,  756,  757,  758,  759,
        760,  761,  762,  763,  764,  765,  766,  767,  768,  769,  770,
        771,  772,  773,  774,  775,  776,  777,  778,  779,  780,  781,
        782,  783,  784,  785,  786,  787,  788,  789,  790,  791,  792,
        793,  794,  795,  796,  797,  798,  799,  800,  801,  802,  803,
        804,  805,  806,  807,  808,  809,  810,  811,  812,  813,  814,
        815,  816,  817,  818,  819,  820,  821,  822,  823,  824,  825,
        826,  827,  828,  829,  830,  831,  832,  833,  834,  835,  836,
        837,  838,  839,  840,  841,  842,  843,  844,  845,  846,  847,
        848,  849,  850,  851,  852,  853,  854,  855,  856,  857,  858,
        859,  860,  861,  862,  863,  864,  865,  866,  867,  868,  869,
        870,  871,  872,  873,  874,  875,  876,  877,  878,  879,  880,
        881,  882,  883,  884,  885,  886,  887,  888,  889,  890,  891,
        892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000],
      dtype=int64)

In [40]:
len(df_film['film_id'].unique())

1000

In [41]:
df_film['title_id'] = df_film.index # 'film' con el 'title_id' añadido
df_film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,special_features,title_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,"Trailers,Deleted Scenes",1
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,"Trailers,Deleted Scenes",2
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,Deleted Scenes,4
...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,"Trailers,Behind the Scenes",995
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,"Trailers,Behind the Scenes",996
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,Deleted Scenes,997
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,"Trailers,Deleted Scenes",998
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,"Trailers,Commentaries,Behind the Scenes",999

In [42]:
film_2 = df_film.copy()

In [43]:
df_film.duplicated().any()

False

## df 'film' filtrado

In [44]:
# Lista de valores a comparar, valores de 'film_id' del inventario
valores = [1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,  27,
        28,  29,  30,  31,  32,  34,  35,  37,  39,  40,  42,  43,  44,
        45,  46,  47,  48,  49,  50,  51,  52,  53,  54,  55,  56,  57,
        58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
        71,  72,  73,  74,  75,  76,  77,  78,  79,  80,  81,  82,  83,
        84,  85,  86,  88,  89,  90,  91,  92,  93,  94,  95,  96,  97,
        98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 109, 110, 111,
       112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124,
       125, 126, 127, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,
       139, 140, 141, 142, 143, 145, 146, 147, 149, 150, 151, 152, 153,
       154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166,
       167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 178, 179, 180,
       181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 193, 194,
       196, 197, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209,
       210, 211, 212, 213, 214, 215, 216, 218, 219, 220, 222, 223]

# Filtrar el DataFrame basado en la lista de valores
film = df_film[df_film['film_id'].isin(valores)]
film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,special_features,title_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,"Trailers,Deleted Scenes",1
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,"Trailers,Deleted Scenes",2
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,Deleted Scenes,4
...,...,...,...,...,...,...,...,...,...,...,...
217,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,1,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217
218,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,1,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218
219,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,1,7,2.99,106,13.99,Deleted Scenes,219
221,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,1,4,4.99,64,27.99,"Trailers,Behind the Scenes",221
222,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,1,7,2.99,76,24.99,Deleted Scenes,222

In [45]:
len(valores)

207

In [46]:
len(film['film_id'].unique())

207

In [47]:
film.duplicated().any()

False

In [48]:
film.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 222
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    object
 2   description       207 non-null    object
 3   release_year      207 non-null    int64
 4   language_id       207 non-null    int64
 5   rental_duration   207 non-null    int64
 6   rental_rate       207 non-null    float64
 7   length            207 non-null    int64
 8   replacement_cost  207 non-null    float64
 9   special_features  207 non-null    object
 10  title_id          207 non-null    int64
dtypes: float64(2), int64(6), object(3)
memory usage: 19.4+ KB

In [49]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'special_features', 'title_id'],
      dtype='object')

# Meter la columna idioma en 'film'

## Idioma añadido

In [50]:
film = pd.merge(film, language[['language_id', 'name']], on='language_id', how='left')
film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,name
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,English
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,"Trailers,Deleted Scenes",2,English
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3,English
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,Deleted Scenes,4,English
...,...,...,...,...,...,...,...,...,...,...,...,...
202,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,1,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217,English
203,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,1,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218,English
204,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,1,7,2.99,106,13.99,Deleted Scenes,219,English
205,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,1,4,4.99,64,27.99,"Trailers,Behind the Scenes",221,English
206,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,1,7,2.99,76,24.99,Deleted Scenes,222,English

In [51]:
film['language_id'].unique()

array([1], dtype=int64)

In [52]:
film = film.drop('language_id', axis=1)
film

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,name
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,English
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",2,English
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3,English
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,4,English
...,...,...,...,...,...,...,...,...,...,...,...
202,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217,English
203,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218,English
204,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,7,2.99,106,13.99,Deleted Scenes,219,English
205,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,4,4.99,64,27.99,"Trailers,Behind the Scenes",221,English
206,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,7,2.99,76,24.99,Deleted Scenes,222,English

In [53]:
film['name'].unique()

array(['English'], dtype=object)

In [54]:
film.columns = ['film_id', 'title', 'description', 'release_year', 'rental_duration', 'rental_rate', 'length', 'replacement_cost', 'special_features', 'title_id', 'language']
film

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,language
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,English
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",2,English
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3,English
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,4,English
...,...,...,...,...,...,...,...,...,...,...,...
202,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217,English
203,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218,English
204,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,7,2.99,106,13.99,Deleted Scenes,219,English
205,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,4,4.99,64,27.99,"Trailers,Behind the Scenes",221,English
206,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,7,2.99,76,24.99,Deleted Scenes,222,English

In [55]:
film.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 206
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    object
 2   description       207 non-null    object
 3   release_year      207 non-null    int64
 4   rental_duration   207 non-null    int64
 5   rental_rate       207 non-null    float64
 6   length            207 non-null    int64
 7   replacement_cost  207 non-null    float64
 8   special_features  207 non-null    object
 9   title_id          207 non-null    int64
 10  language          207 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 19.4+ KB

# Actores limpia

In [56]:
actores = pd.merge(df_actores, df_film[['title', 'title_id']], on='title', how='left') # Agregar la columna 'title_id' a 'actores' basado en la columna 'title'
actores

,first_name,last_name,title,release_year,category_id,title_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,0
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,22
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,24
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,105
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,139
...,...,...,...,...,...,...
995,GOLDIE,BRODY,COMANCHEROS ENEMY,2006,3,167
996,GOLDIE,BRODY,DAISY MENAGERIE,2006,14,202
997,GOLDIE,BRODY,DESERT POSEIDON,2006,11,221
998,GOLDIE,BRODY,EVERYONE CRAFT,2006,9,289
999,GOLDIE,BRODY,EXORCIST STING,2006,15,292

In [57]:
actores.columns

Index(['first_name', 'last_name', 'title', 'release_year', 'category_id',
       'title_id'],
      dtype='object')

In [58]:
actores.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
 5   title_id      1000 non-null   int64
dtypes: int64(3), object(3)
memory usage: 54.7+ KB

In [59]:
actores = actores.drop('release_year', axis=1)
actores

    first_name last_name                  title  category_id  title_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR            6         0
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS            2        22
2     PENELOPE   GUINESS            ANGELS LIFE           13        24
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10       105
4     PENELOPE   GUINESS          CHEAPER CLYDE           14       139
..         ...       ...                    ...          ...       ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY            3       167
996     GOLDIE     BRODY        DAISY MENAGERIE           14       202
997     GOLDIE     BRODY        DESERT POSEIDON           11       221
998     GOLDIE     BRODY         EVERYONE CRAFT            9       289
999     GOLDIE     BRODY         EXORCIST STING           15       292

[1000 rows x 5 columns]

In [60]:
len(actores.title_id.unique())

614

In [61]:
bad_index = actores['title_id'][actores['title_id'].isna()].index

bad_index

Int64Index([], dtype='int64')

In [62]:
actor

     actor_id first_name     last_name                 name
0           1   PENELOPE       GUINESS     PENELOPE GUINESS
1           2       NICK      WAHLBERG        NICK WAHLBERG
2           3         ED         CHASE             ED CHASE
3           4   JENNIFER         DAVIS       JENNIFER DAVIS
4           5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA
..        ...        ...           ...                  ...
195       196       BELA        WALKEN          BELA WALKEN
196       197      REESE          WEST           REESE WEST
197       198       MARY        KEITEL          MARY KEITEL
198       199      JULIA       FAWCETT        JULIA FAWCETT
199       200      THORA        TEMPLE         THORA TEMPLE

[200 rows x 4 columns]

In [63]:
actores

    first_name last_name                  title  category_id  title_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR            6         0
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS            2        22
2     PENELOPE   GUINESS            ANGELS LIFE           13        24
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10       105
4     PENELOPE   GUINESS          CHEAPER CLYDE           14       139
..         ...       ...                    ...          ...       ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY            3       167
996     GOLDIE     BRODY        DAISY MENAGERIE           14       202
997     GOLDIE     BRODY        DESERT POSEIDON           11       221
998     GOLDIE     BRODY         EVERYONE CRAFT            9       289
999     GOLDIE     BRODY         EXORCIST STING           15       292

[1000 rows x 5 columns]

In [64]:
# matchear tabla actor con actores

In [65]:
merged_df = pd.merge(actor, actores, on=['first_name', 'last_name'])
merged_df

,actor_id,first_name,last_name,name,title,category_id,title_id
0,1,PENELOPE,GUINESS,PENELOPE GUINESS,ACADEMY DINOSAUR,6,0
1,1,PENELOPE,GUINESS,PENELOPE GUINESS,ANACONDA CONFESSIONS,2,22
2,1,PENELOPE,GUINESS,PENELOPE GUINESS,ANGELS LIFE,13,24
3,1,PENELOPE,GUINESS,PENELOPE GUINESS,BULWORTH COMMANDMENTS,10,105
4,1,PENELOPE,GUINESS,PENELOPE GUINESS,CHEAPER CLYDE,14,139
...,...,...,...,...,...,...,...
995,39,GOLDIE,BRODY,GOLDIE BRODY,COMANCHEROS ENEMY,3,167
996,39,GOLDIE,BRODY,GOLDIE BRODY,DAISY MENAGERIE,14,202
997,39,GOLDIE,BRODY,GOLDIE BRODY,DESERT POSEIDON,11,221
998,39,GOLDIE,BRODY,GOLDIE BRODY,EVERYONE CRAFT,9,289
999,39,GOLDIE,BRODY,GOLDIE BRODY,EXORCIST STING,15,292

In [66]:
merged_df = merged_df.drop(['first_name', 'last_name', 'title'], axis=1)
merged_df

     actor_id              name  category_id  title_id
0           1  PENELOPE GUINESS            6         0
1           1  PENELOPE GUINESS            2        22
2           1  PENELOPE GUINESS           13        24
3           1  PENELOPE GUINESS           10       105
4           1  PENELOPE GUINESS           14       139
..        ...               ...          ...       ...
995        39      GOLDIE BRODY            3       167
996        39      GOLDIE BRODY           14       202
997        39      GOLDIE BRODY           11       221
998        39      GOLDIE BRODY            9       289
999        39      GOLDIE BRODY           15       292

[1000 rows x 4 columns]

In [67]:
merged_df['actor_id'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39], dtype=int64)

In [68]:
merged_df = pd.merge(merged_df, film_2[['title_id', 'film_id']], on='title_id', how='left')
merged_df

     actor_id              name  category_id  title_id  film_id
0           1  PENELOPE GUINESS            6         0        1
1           1  PENELOPE GUINESS            2        22       23
2           1  PENELOPE GUINESS           13        24       25
3           1  PENELOPE GUINESS           10       105      106
4           1  PENELOPE GUINESS           14       139      140
..        ...               ...          ...       ...      ...
995        39      GOLDIE BRODY            3       167      168
996        39      GOLDIE BRODY           14       202      203
997        39      GOLDIE BRODY           11       221      222
998        39      GOLDIE BRODY            9       289      290
999        39      GOLDIE BRODY           15       292      293

[1000 rows x 5 columns]

In [69]:
util = merged_df.copy()
util

     actor_id              name  category_id  title_id  film_id
0           1  PENELOPE GUINESS            6         0        1
1           1  PENELOPE GUINESS            2        22       23
2           1  PENELOPE GUINESS           13        24       25
3           1  PENELOPE GUINESS           10       105      106
4           1  PENELOPE GUINESS           14       139      140
..        ...               ...          ...       ...      ...
995        39      GOLDIE BRODY            3       167      168
996        39      GOLDIE BRODY           14       202      203
997        39      GOLDIE BRODY           11       221      222
998        39      GOLDIE BRODY            9       289      290
999        39      GOLDIE BRODY           15       292      293

[1000 rows x 5 columns]

In [70]:
len(merged_df['film_id'].unique())

614

In [71]:
util_2 = util.copy()
util_2

     actor_id              name  category_id  title_id  film_id
0           1  PENELOPE GUINESS            6         0        1
1           1  PENELOPE GUINESS            2        22       23
2           1  PENELOPE GUINESS           13        24       25
3           1  PENELOPE GUINESS           10       105      106
4           1  PENELOPE GUINESS           14       139      140
..        ...               ...          ...       ...      ...
995        39      GOLDIE BRODY            3       167      168
996        39      GOLDIE BRODY           14       202      203
997        39      GOLDIE BRODY           11       221      222
998        39      GOLDIE BRODY            9       289      290
999        39      GOLDIE BRODY           15       292      293

[1000 rows x 5 columns]

In [72]:
film_definitiva = pd.merge(film_2, util_2[['film_id', 'category_id']], on='film_id', how='inner')
film_definitiva

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,6
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,6
2,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,6
3,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,6
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,11
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,"Trailers,Behind the Scenes",995,6
996,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,"Trailers,Behind the Scenes",995,6
997,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,"Trailers,Behind the Scenes",996,12
998,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,"Trailers,Behind the Scenes",996,12
999,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,Deleted Scenes,997,11

In [73]:
film_definitiva['category_id'].unique()

array([ 6, 11,  9, 15, 12,  4,  1,  2, 13,  8, 14,  7, 16, 10,  3,  5],
      dtype=int64)

In [74]:
film_definitiva.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   special_features  1000 non-null   object
 10  title_id          1000 non-null   int64
 11  category_id       1000 non-null   int64
dtypes: float64(2), int64(7), object(3)
memory usage: 101.6+ KB

In [75]:
#film_definitiva = film_definitiva.drop(['title', 'description', 'release_year', 'language_id', 'rental_duration', 'rental_rate', 'length', 'replacement_cost', 'special_features', 'title_id'], axis=1)
#film_definitiva

# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

In [76]:
film = pd.merge(film, film_definitiva[['title_id', 'category_id']], on='title_id', how='left')
film

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,language,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English,6.0
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English,6.0
2,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English,6.0
3,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English,6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,English,11.0
...,...,...,...,...,...,...,...,...,...,...,...,...
293,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217,English,7.0
294,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218,English,6.0
295,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,7,2.99,106,13.99,Deleted Scenes,219,English,NaN
296,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,4,4.99,64,27.99,"Trailers,Behind the Scenes",221,English,11.0
297,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,7,2.99,76,24.99,Deleted Scenes,222,English,2.0

In [77]:
film.duplicated().any()

True

In [78]:
film = film.drop_duplicates()
film

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,title_id,language,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",0,English,6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",1,English,11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",2,English,6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",3,English,NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,4,English,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
292,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,2006,7,0.99,122,22.99,"Trailers,Commentaries,Deleted Scenes,Behind th...",217,English,7.0
294,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,2006,6,4.99,51,20.99,"Commentaries,Behind the Scenes",218,English,6.0
295,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,2006,7,2.99,106,13.99,Deleted Scenes,219,English,NaN
296,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,2006,4,4.99,64,27.99,"Trailers,Behind the Scenes",221,English,11.0
297,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,2006,7,2.99,76,24.99,Deleted Scenes,222,English,2.0

In [79]:
film.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 297
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    object
 2   description       207 non-null    object
 3   release_year      207 non-null    int64
 4   rental_duration   207 non-null    int64
 5   rental_rate       207 non-null    float64
 6   length            207 non-null    int64
 7   replacement_cost  207 non-null    float64
 8   special_features  207 non-null    object
 9   title_id          207 non-null    int64
 10  language          207 non-null    object
 11  category_id       135 non-null    float64
dtypes: float64(3), int64(5), object(4)
memory usage: 21.0+ KB

In [80]:
film.fillna(0, inplace=True)
film.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 297
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    object
 2   description       207 non-null    object
 3   release_year      207 non-null    int64
 4   rental_duration   207 non-null    int64
 5   rental_rate       207 non-null    float64
 6   length            207 non-null    int64
 7   replacement_cost  207 non-null    float64
 8   special_features  207 non-null    object
 9   title_id          207 non-null    int64
 10  language          207 non-null    object
 11  category_id       207 non-null    float64
dtypes: float64(3), int64(5), object(4)
memory usage: 21.0+ KB

In [81]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'rental_duration',
       'rental_rate', 'length', 'replacement_cost', 'special_features',
       'title_id', 'language', 'category_id'],
      dtype='object')

In [82]:
# Especificar el nuevo orden de columnas
new_order = ['film_id', 'title', 'description', 'release_year', 'rental_duration',
             'rental_rate', 'length', 'replacement_cost', 'special_features', 'language', 'title_id', 'category_id']

# Reindexar el DataFrame con el nuevo orden de columnas
film = film.reindex(columns=new_order)
film.head()

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,language,title_id,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",English,0,6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",English,1,11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",English,2,6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",English,3,0.0
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,English,4,0.0

In [83]:
film = film.drop('title_id', axis=1)
film.head()

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,language,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",English,6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",English,11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",English,6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",English,0.0
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,English,0.0

In [84]:
film['category_id'] = pd.to_numeric(film['category_id'], errors='coerce').astype('Int64')
film.head()

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,language,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",English,6
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",English,11
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",English,6
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",English,0
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,English,0

In [85]:
film = capitalize_first_letter(film, 'title')
film.head()

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,special_features,language,category_id
0,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,"Deleted Scenes,Behind the Scenes",English,6
4,2,Ace Goldfinger,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,"Trailers,Deleted Scenes",English,11
5,3,Adaptation Holes,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,"Trailers,Deleted Scenes",English,6
8,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,"Commentaries,Behind the Scenes",English,0
9,5,African Egg,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,Deleted Scenes,English,0

In [86]:
film.to_csv(r'..\data\df_film.csv', index=False)

In [87]:
# actor

In [88]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     1000 non-null   int64
 1   name         1000 non-null   object
 2   category_id  1000 non-null   int64
 3   title_id     1000 non-null   int64
 4   film_id      1000 non-null   int64
dtypes: int64(4), object(1)
memory usage: 46.9+ KB

In [89]:
merged_df = merged_df.drop(['category_id', 'title_id', 'name'], axis=1)
merged_df

     actor_id  film_id
0           1        1
1           1       23
2           1       25
3           1      106
4           1      140
..        ...      ...
995        39      168
996        39      203
997        39      222
998        39      290
999        39      293

[1000 rows x 2 columns]

In [90]:
merged_df.to_csv(r'..\data\df_actor_film.csv', index=False)

# Rental (done)

In [91]:
df_rental_origin = pd.read_csv(r'..\data\rental.csv', encoding='latin1')
df_rental = df_rental_origin.copy()
df_rental.head(20)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53
10,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2,2006-02-15 21:30:53
11,12,2005-05-25 00:19:27,1584,261,2005-05-30 05:44:27,2,2006-02-15 21:30:53
12,13,2005-05-25 00:22:55,2294,334,2005-05-30 04:28:55,1,2006-02-15 21:30:53
13,14,2005-05-25 00:31:15,2701,446,2005-05-26 02:56:15,1,2006-02-15 21:30:53
14,15,2005-05-25 00:39:22,3049,319,2005-06-03 03:30:22,1,2006-02-15 21:30:53
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53
17,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,2006-02-15 21:30:53
18,19,2005-05-25 01:17:24,1941,456,2005-05-31 06:00:24,1,2006-02-15 21:30:53
19,20,2005-05-25 01:48:41,3517,185,2005-05-27 02:20:41,2,2006-02-15 21:30:53

In [92]:
df_rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [93]:
df_rental.shape

(1000, 7)

In [94]:
rental = pd.DataFrame()

In [95]:
rental['rental_id'] = [1]
rental['rental_date'] = ['2022-09-15']
rental['return_date'] = ['2022-09-22']
rental['last_update'] = ['2022-09-15']
rental['inventory_id'] = [1]
rental['customer_id'] = [1]
rental['staff_id'] = [1]


rental

,rental_id,rental_date,return_date,last_update,inventory_id,customer_id,staff_id
0,1,2022-09-15,2022-09-22,2022-09-15,1,1,1

In [96]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1 non-null      int64
 1   rental_date   1 non-null      object
 2   return_date   1 non-null      object
 3   last_update   1 non-null      object
 4   inventory_id  1 non-null      int64
 5   customer_id   1 non-null      int64
 6   staff_id      1 non-null      int64
dtypes: int64(4), object(3)
memory usage: 184.0+ bytes

In [97]:
rental['rental_date'] = pd.to_datetime(rental['rental_date'])
rental['return_date'] = pd.to_datetime(rental['return_date'])
rental['last_update'] = pd.to_datetime(rental['last_update'])

In [98]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1 non-null      int64
 1   rental_date   1 non-null      datetime64[ns]
 2   return_date   1 non-null      datetime64[ns]
 3   last_update   1 non-null      datetime64[ns]
 4   inventory_id  1 non-null      int64
 5   customer_id   1 non-null      int64
 6   staff_id      1 non-null      int64
dtypes: datetime64[ns](3), int64(4)
memory usage: 184.0 bytes

In [99]:
rental.head()

,rental_id,rental_date,return_date,last_update,inventory_id,customer_id,staff_id
0,1,2022-09-15,2022-09-22,2022-09-15,1,1,1

In [100]:
rental.to_csv(r'..\data\df_rental.csv', index=False)

# Customer (done)

In [101]:
# Creación de un DataFrame vacío
customer = pd.DataFrame()

In [102]:
customer['customer_id'] = [1]
customer['first_name'] = ['Gabriela']
customer['last_name'] = ['Harrel']
customer['DNI_NIE'] = ['12345678A']
customer['address'] = ['Calle Principal, 123']
customer['email'] = ['gabriela.harrel@example.com']
customer['phone'] = [123456789]

customer

,customer_id,first_name,last_name,DNI_NIE,address,email,phone
0,1,Gabriela,Harrel,12345678A,"Calle Principal, 123",gabriela.harrel@example.com,123456789

In [103]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  1 non-null      int64
 1   first_name   1 non-null      object
 2   last_name    1 non-null      object
 3   DNI_NIE      1 non-null      object
 4   address      1 non-null      object
 5   email        1 non-null      object
 6   phone        1 non-null      int64
dtypes: int64(2), object(5)
memory usage: 184.0+ bytes

In [104]:
customer.to_csv(r'..\data\df_customer.csv', index=False)

# Staff

In [105]:
staff = pd.DataFrame()

In [106]:
staff['staff_id'] = [1]
staff['first_name'] = ['Maxwell']
staff['last_name'] = ['Bennett']

In [107]:
staff.to_csv(r'..\data\df_staff.csv', index=False)

# Actor

In [108]:
actor = actor.drop(['first_name', 'last_name'], axis=1)
actor

     actor_id                 name
0           1     PENELOPE GUINESS
1           2        NICK WAHLBERG
2           3             ED CHASE
3           4       JENNIFER DAVIS
4           5  JOHNNY LOLLOBRIGIDA
..        ...                  ...
195       196          BELA WALKEN
196       197           REESE WEST
197       198          MARY KEITEL
198       199        JULIA FAWCETT
199       200         THORA TEMPLE

[200 rows x 2 columns]

In [109]:
actor = capitalize_first_letter(actor, 'name')
actor.head()

   actor_id                 name
0         1     Penelope Guiness
1         2        Nick Wahlberg
2         3             Ed Chase
3         4       Jennifer Davis
4         5  Johnny Lollobrigida

In [110]:
actor.to_csv(r'..\data\df_actor.csv', index=False)

# Title (no me sirve, la puedo quitar)

In [111]:
title = pd.read_csv(r'..\data\df_title.csv')
title

     actor_id                  title  category_id  title_id
0           1       ACADEMY DINOSAUR            6         0
1           1   ANACONDA CONFESSIONS            2        22
2           1            ANGELS LIFE           13        24
3           1  BULWORTH COMMANDMENTS           10       105
4           1          CHEAPER CLYDE           14       139
..        ...                    ...          ...       ...
995        39      COMANCHEROS ENEMY            3       167
996        39        DAISY MENAGERIE           14       202
997        39        DESERT POSEIDON           11       221
998        39         EVERYONE CRAFT            9       289
999        39         EXORCIST STING           15       292

[1000 rows x 4 columns]

In [112]:
title.columns

Index(['actor_id', 'title', 'category_id', 'title_id'], dtype='object')

In [113]:
# Especificar el nuevo orden de columnas
new_order = ['title_id', 'title', 'actor_id', 'category_id']

# Reindexar el DataFrame con el nuevo orden de columnas
title = title.reindex(columns=new_order)
title

     title_id                  title  actor_id  category_id
0           0       ACADEMY DINOSAUR         1            6
1          22   ANACONDA CONFESSIONS         1            2
2          24            ANGELS LIFE         1           13
3         105  BULWORTH COMMANDMENTS         1           10
4         139          CHEAPER CLYDE         1           14
..        ...                    ...       ...          ...
995       167      COMANCHEROS ENEMY        39            3
996       202        DAISY MENAGERIE        39           14
997       221        DESERT POSEIDON        39           11
998       289         EVERYONE CRAFT        39            9
999       292         EXORCIST STING        39           15

[1000 rows x 4 columns]

In [114]:
len(title.title_id.unique())

614

# Optimización de la memoria cambiando el tipo de dato

## actores

In [115]:
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   actor_id  200 non-null    int64
 1   name      200 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.3 KB

In [116]:
for c in actor.select_dtypes(include='object'):
    
    actor[c] = actor[c].astype('category')   # cambia el tipo a categoria
    
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   actor_id  200 non-null    int64
 1   name      200 non-null    category
dtypes: category(1), int64(1)
memory usage: 23.7 KB

In [117]:
actor.to_csv(r'..\data\df_actor_op.csv', index=False)

## film

In [118]:
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 297
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    object
 2   description       207 non-null    object
 3   release_year      207 non-null    int64
 4   rental_duration   207 non-null    int64
 5   rental_rate       207 non-null    float64
 6   length            207 non-null    int64
 7   replacement_cost  207 non-null    float64
 8   special_features  207 non-null    object
 9   language          207 non-null    object
 10  category_id       207 non-null    Int64
dtypes: Int64(1), float64(2), int64(4), object(4)
memory usage: 88.4 KB

In [119]:
for c in film.select_dtypes(include='object'):
    
    film[c] = film[c].astype('category')   # cambia el tipo a categoria
    
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 297
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           207 non-null    int64
 1   title             207 non-null    category
 2   description       207 non-null    category
 3   release_year      207 non-null    int64
 4   rental_duration   207 non-null    int64
 5   rental_rate       207 non-null    float64
 6   length            207 non-null    int64
 7   replacement_cost  207 non-null    float64
 8   special_features  207 non-null    category
 9   language          207 non-null    category
 10  category_id       207 non-null    Int64
dtypes: Int64(1), category(4), float64(2), int64(4)
memory usage: 77.7 KB

In [120]:
film.to_csv(r'..\data\df_film_op.csv', index=False)

## category

In [121]:
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   category     16 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.2 KB

In [122]:
for c in category.select_dtypes(include='object'):
    
    category[c] = category[c].astype('category')   # cambia el tipo a categoria
    
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   category     16 non-null     category
dtypes: category(1), int64(1)
memory usage: 1.8 KB

In [123]:
category.to_csv(r'..\data\df_category_op.csv', index=False)

# Miro que hay en el csv df_title

In [124]:
titulo = pd.read_csv(r'..\data\df_title.csv') # puedo omitir esta tabla, no tiene info relevante.
titulo

     actor_id                  title  category_id  title_id
0           1       ACADEMY DINOSAUR            6         0
1           1   ANACONDA CONFESSIONS            2        22
2           1            ANGELS LIFE           13        24
3           1  BULWORTH COMMANDMENTS           10       105
4           1          CHEAPER CLYDE           14       139
..        ...                    ...          ...       ...
995        39      COMANCHEROS ENEMY            3       167
996        39        DAISY MENAGERIE           14       202
997        39        DESERT POSEIDON           11       221
998        39         EVERYONE CRAFT            9       289
999        39         EXORCIST STING           15       292

[1000 rows x 4 columns]

# Comprobación encoding

In [125]:
# Lectura del archivo CSV y detección del encoding
resultado = cn.from_path(r'..\data\df_actor.csv')
encoding_2 = resultado.best().first().encoding
encoding_2

'ascii'

In [126]:
with open(r'..\data\df_actor.csv', 'rb') as f:
    result = chardet.detect(f.read())

encoding = result['encoding']
actor = pd.read_csv(r'..\data\df_actor.csv', encoding=encoding)
encoding

'ascii'

In [127]:
with open(r'..\data\df_customer.csv', 'rb') as f:
    result_1 = chardet.detect(f.read())

encoding_1 = result_1['encoding']
customer = pd.read_csv(r'..\data\df_customer.csv', encoding=encoding)
encoding_1

'ascii'

# Cambio de encoding a UTF-8

In [128]:
actor.to_csv(r'..\data\df_actor_utf8.csv', encoding="utf-8", index=False)

In [129]:
film.to_csv(r'..\data\df_film_utf8.csv', encoding="utf-8", index=False)

In [130]:
link = pd.read_csv(r'..\data\df_actor_film.csv')

link.to_csv(r'..\data\link_utf8.csv', encoding="utf-8", index=False)

In [131]:
inventory.to_csv(r'..\data\df_inventory_utf8.csv', encoding="utf-8", index=False)

In [132]:
rental.to_csv(r'..\data\df_rental_utf8.csv', encoding="utf-8", index=False)

In [133]:
staff.to_csv(r'..\data\df_staff_utf8.csv', encoding="utf-8", index=False)

# Importación de los datos a workbench

In [134]:
from sqlalchemy import create_engine
from Password import password
str_conn = f'mysql+pymysql://root:{password}@localhost:3306/blockbuster'
cursor = create_engine(str_conn)

In [135]:
actor = actor.set_index('actor_id')
actor

                         name
actor_id
1            Penelope Guiness
2               Nick Wahlberg
3                    Ed Chase
4              Jennifer Davis
5         Johnny Lollobrigida
...                       ...
196               Bela Walken
197                Reese West
198               Mary Keitel
199             Julia Fawcett
200              Thora Temple

[200 rows x 1 columns]

In [136]:
actor.to_sql(name='actor',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True
           )

200

In [137]:
film = film.set_index('film_id')

In [138]:
film.to_sql(name='film',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True
           )

207

In [139]:
link = link.set_index('actor_id')
link

          film_id
actor_id
1               1
1              23
1              25
1             106
1             140
...           ...
39            168
39            203
39            222
39            290
39            293

[1000 rows x 1 columns]

In [140]:
link.to_sql(name='actor_film',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True
           )

1000

In [141]:
rental = rental.set_index('rental_id')

In [142]:
rental.to_sql(name='rental',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True
           )

1

In [143]:
staff = staff.set_index('staff_id')

In [144]:
staff.to_sql(name='staff',       # nombre de la tabla
            con=cursor,           # conexion al servidor
            if_exists='replace',  # replace sobreescribe la tabla
            index=True
           )

1

In [145]:
customer = customer.set_index('customer_id')

In [146]:
customer.to_sql(name='customer',       # nombre de la tabla
            con=cursor,                # conexion al servidor
            if_exists='replace',       # replace sobreescribe la tabla
            index=True
           )

1

In [147]:
category = category.set_index('category_id')

In [148]:
category.to_sql(name='category',       # nombre de la tabla
            con=cursor,                # conexion al servidor
            if_exists='replace',       # replace sobreescribe la tabla
            index=True
           )

16

In [149]:
inventory = inventory.set_index('inventory_id')

In [150]:
inventory.to_sql(name='inventory',       # nombre de la tabla
            con=cursor,                  # conexion al servidor
            if_exists='replace',         # replace sobreescribe la tabla
            index=True
           )

1000